TexasInstruments/f29h85x-mcal/plugins/Adc_TI_F29H85x/generate/src/Cdd_Adc_Cfg.c
    [!IF "($HwUnit = 'CDD_ADCA')"!]
    [!VAR "AdcNum"   = "0"!]
    [!ENDIF!]

    [!IF "($HwUnit = 'CDD_ADCB')"!]
    [!VAR "AdcNum"   = "1"!]
    [!ENDIF!]


    [!IF "($HwUnit = 'CDD_ADCC')"!]
    [!VAR "AdcNum"   = "2"!]
    [!ENDIF!]


    [!IF "($HwUnit = 'CDD_ADCD')"!]
    [!VAR "AdcNum"   = "3"!]
    [!ENDIF!]


    [!IF "($HwUnit = 'CDD_ADCE')"!]
    [!VAR "AdcNum"   = "4"!]
    [!ENDIF!]

[!CODE!][!"num:i($AdcNum)"!][!ENDCODE!]
[!ENDNOCODE!][!ENDMACRO!][!//
[!//
[!NOCODE!][!//
[!LOOP "as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcResultCheckerUnit/.//*[@name='CddAdcCheckerResultType']"!]

[!VAR "InputResultType" = "node:value(.)"!]

[!VAR "InputNumber" = "node:name(../.)"!]
[!VAR "CheckerNumber" = "node:name(../../.)"!]

[!IF "node:value(.) = 'CDD_ADC_SAFETY_CHECKER_INPUT_SOC'"!]
    [!VAR "AdcHwUnit" = "node:value(concat(node:path(node:ref(../CddAdcChannelReference)),'/../../../../CddAdcHwInstance'))"!]
    [!VAR "AdcSocNumber" = "num:i(node:value(concat(node:path(node:ref(../CddAdcChannelReference)),'/CddAdcSocNumber')))"!]
[!ELSE!]
    [!VAR "AdcHwUnit" = "node:value(concat(node:path(node:ref(../CddAdcPpbReference)),'/../../CddAdcHwInstance'))"!]
    [!VAR "AdcSocNumber" = "num:i(node:value(concat(node:path(node:ref(../CddAdcPpbReference)),'/CddAdcPpbSocNumber')))"!]
[!ENDIF!]

[!LOOP "as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcResultCheckerUnit/.//*[@name='CddAdcCheckerResultType']"!]

[!IF "node:value(.) = 'CDD_ADC_SAFETY_CHECKER_INPUT_SOC'"!]
    [!VAR "CurAdcHwUnit" = "node:value(concat(node:path(node:ref(../CddAdcChannelReference)),'/../../../../CddAdcHwInstance'))"!]
    [!VAR "CurAdcSocNumber" = "num:i(node:value(concat(node:path(node:ref(../CddAdcChannelReference)),'/CddAdcSocNumber')))"!]
[!ELSE!]
    [!VAR "CurAdcHwUnit" = "node:value(concat(node:path(node:ref(../CddAdcPpbReference)),'/../../CddAdcHwInstance'))"!]
    [!VAR "CurAdcSocNumber" = "num:i(node:value(concat(node:path(node:ref(../CddAdcPpbReference)),'/CddAdcPpbSocNumber')))"!]
[!ENDIF!]

[!VAR "CurInputResultType" = "node:value(.)"!]

[!IF "($AdcHwUnit = $CurAdcHwUnit) and (num:i($AdcSocNumber) = num:i($CurAdcSocNumber)) and ($InputResultType != $CurInputResultType)"!]
[!ERROR!]
Same Soc can't be selected as input to safety checker for different result type input

[!"$AdcHwUnit"!] SOC[!"$AdcSocNumber"!] is select as input to safety checkers with different result types: 
[!"$InputResultType"!] of [!"$CheckerNumber"!]/[!"$InputNumber"!]
and  [!"$CurInputResultType"!]  of [!"node:name(../../.)"!]/[!"node:name(../.)"!]

Only one result type should be selected for a SOC of a hardware unit

[!ENDERROR!]
[!ENDIF!]

[!ENDLOOP!]
[!ENDLOOP!]
[!ENDNOCODE!][!//

/*********************************************************************************************************************
 * Local Type Declarations
 *********************************************************************************************************************/

 /*********************************************************************************************************************
 * Exported Object Definitions
 *********************************************************************************************************************/
/** \brief Cdd Adc Driver configuration */

#define CDD_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
#include "Cdd_Adc_MemMap.h"
[!SELECT "as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']"!][!//
[!NOCODE!][!//
[!VAR "RepCount" = "num:i(0)"!]
[!VAR "TrigRepEnable" = "num:i(count(CddAdcConfigSet/CddAdcHwUnit/*/CddAdcTriggerRepeater/*))"!]
[!VAR "GroupCount" = "0"!]
[!VAR "HwGroup0Cnt" ="num:i(0)"!]
[!VAR "HwGroup1Cnt" ="num:i($HwGroup0Cnt+num:i(count(CddAdcConfigSet/CddAdcHwUnit/*[1]/CddAdcGroup/*)))"!]
[!VAR "HwGroup2Cnt" ="num:i($HwGroup1Cnt+num:i(count(CddAdcConfigSet/CddAdcHwUnit/*[2]/CddAdcGroup/*)))"!]
[!VAR "HwGroup3Cnt" ="num:i($HwGroup2Cnt+num:i(count(CddAdcConfigSet/CddAdcHwUnit/*[3]/CddAdcGroup/*)))"!]
[!VAR "HwGroup4Cnt" ="num:i($HwGroup3Cnt+num:i(count(CddAdcConfigSet/CddAdcHwUnit/*[4]/CddAdcGroup/*)))"!]
[!ENDNOCODE!][!//

[!AUTOSPACING!]
CONST(struct Cdd_Adc_ConfigTag, CDD_ADC_CONFIG_DATA) Cdd_Adc_Config =
{
    .hwunitcfg =
    {
        [!NOCODE!][!VAR "PpbCount" = "num:i(0)"!][!VAR "HwGroupCount" = "num:i(0)"!][!ENDNOCODE!]
        [!LOOP "CddAdcConfigSet/CddAdcHwUnit/*"!]
        [[!"@index"!]] =
        {
            .hwunit_id = (Cdd_Adc_HwUnitType)[!"CddAdcHwInstance"!],
            .prescale = (Cdd_Adc_PrescaleType)[!"CddAdcHwUnitClockPrescale"!],
            .resolution = (Cdd_Adc_ResolutionType)[!"CddAdcHwUnitResolution"!],
            #if (STD_ON == CDD_ADC_SET_RESOLUTION_API)
            [!NOCODE!][!VAR "update_support" = "'true'"!]
            [!LOOP "(CddAdcGroup/*/CddAdcChannel/*)"!][!IF "((node:value(CddAdcChannelId) = 20) and (text:contains(ecu:list('ResourceAllocator_F29H85x.Cdd_AdcTempSensor_Instances'),node:value(../../../../CddAdcHwInstance))))"!][!VAR "update_support" = "'false'"!][!BREAK!][!ENDIF!][!ENDLOOP!][!ENDNOCODE!]
            .resolution_update = (boolean)([!IF "($update_support = 'true') and (text:contains(ecu:list('ResourceAllocator_F29H85x.Cdd_Adc16Bit_Instances'),node:value(CddAdcHwInstance))) and (not((../../CddAdcHwUnitAnalogRefABVoltageMode = 'CDD_ADC_REFERENCE_INTERNAL') and (../../CddAdcHwUnitAnalogRefABVoltage = 'CDD_ADC_REFERENCE_3_3V')))"!]1U[!ELSE!]0U[!ENDIF!]),
            #endif
            .signal_mode = (Cdd_Adc_SignalModeType)[!"CddAdcHwUnitSignalMode"!],
            .socpriority = (Cdd_Adc_SocPriorityType)[!"CddAdcSocPriorityMode"!]U, 
            .voltref = (Cdd_Adc_RefVoltType)[!IF "(CddAdcHwInstance ='CDD_ADCA' or CddAdcHwInstance = 'CDD_ADCB')"!][!"../../CddAdcHwUnitAnalogRefABVoltage"!][!ELSE!][!"../../CddAdcHwUnitAnalogRefCDEVoltage"!][!ENDIF!],
            .voltrefmode = (Cdd_Adc_RefModeType)[!IF "(CddAdcHwInstance ='CDD_ADCA' or CddAdcHwInstance='CDD_ADCB')"!][!"../../CddAdcHwUnitAnalogRefABVoltageMode"!][!ELSE!][!"../../CddAdcHwUnitAnalogRefCDEVoltageMode"!][!ENDIF!],
[!IF "num:i(count(as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcHwUnit/*/CddAdcPpbConfig/*)) > 0"!]
            .startppbnum = (Cdd_Adc_PpbType)([!"num:i($PpbCount)"!]U),
            .ppbcount = (Cdd_Adc_PpbType)([!"num:i(count(CddAdcPpbConfig/*))"!]U),
[!ENDIF!]
            .intpulsemode = (Cdd_Adc_EocPulseType)[!"CddAdcInterruptPulseMode"!],
            .intoffset = (uint16)[!"CddAdcInterruptCycleoffset"!]U,
#if(STD_ON == CDD_ADC_OPEN_SHORT_DETECTION)    
            .osdetectmode = ((Cdd_Adc_OsDetectModeType)[!"CddAdcOpenShortDetectMode"!]),
#endif
#if(STD_ON == CDD_ADC_EXTCHSEL_CAPABILITY)     
            .extchnsel = (boolean)([!"num:i(node:when((CddAdcHwExternalMuxSelect = 'false'),0,1))"!]U),       
            .extmuxpreselect = (boolean)([!"num:i(node:when(node:exists(CddAdcHwExternalMuxPreselectEnable),node:when((CddAdcHwExternalMuxPreselectEnable='false'),0,1),0))"!]U),
#endif
            .startgroupnum = (Cdd_Adc_GroupType)([!"num:i($HwGroupCount)"!]U),
            .lastgroupnum = (Cdd_Adc_GroupType)([!"num:i($HwGroupCount + num:i(count(CddAdcGroup/*))-1)"!]U),
            .base_addr = (uint32)([!"node:value(node:ref(CddAdcHwInstanceRef)/BaseAddr)"!]),
            [!VAR "AdcNum"!][!CALL "GetAdcNum", "HwUnit" = "CddAdcHwInstance"!][!ENDVAR!]
            .result_baseaddr = (uint32)( ADCARESULT_BASE + (CDD_ADC_RESULTBASEADDR_STEP*[!"num:i($AdcNum)"!]U)),
            .analogrefsel = (uint16)[!IF "(node:value(CddAdcHwInstance) = 'CDD_ADCA' or node:value(CddAdcHwInstance) = 'CDD_ADCB')"!]ASYSCTL_ANAREFCTL_ANAREFABSEL[!ELSE!]ASYSCTL_ANAREFCTL_ANAREFCDESEL[!ENDIF!],
            .analogrefvoltsel = (uint16)[!IF "(node:value(CddAdcHwInstance) = 'CDD_ADCA' or node:value(CddAdcHwInstance) = 'CDD_ADCB')"!]ASYSCTL_ANAREFCTL_ANAREFAB_2P5SEL[!ELSE!]ASYSCTL_ANAREFCTL_ANAREFCDE_2P5SEL[!ENDIF!],
            .inltrimaddress = [!IF "(node:value(CddAdcHwInstance) = 'CDD_ADCA')"!]((uint32 *)&McalLib_DeviceCalibrationData.AdcAInlTrim[0U])[!ELSEIF "(node:value(CddAdcHwInstance) = 'CDD_ADCB')"!]((uint32 *)&McalLib_DeviceCalibrationData.AdcBInlTrim[0U])[!ELSEIF "(node:value(CddAdcHwInstance) = 'CDD_ADCC')"!]((uint32 *)&McalLib_DeviceCalibrationData.AdcCInlTrim[0U])[!ELSEIF "(node:value(CddAdcHwInstance) = 'CDD_ADCD')"!]((uint32 *)&McalLib_DeviceCalibrationData.AdcDInlTrim[0U])[!ELSEIF "(node:value(CddAdcHwInstance) = 'CDD_ADCE')"!]((uint32 *)&McalLib_DeviceCalibrationData.AdcEInlTrim[0U])[!ELSE!]((uint32 *)&McalLib_DeviceCalibrationData.AdcAInlTrim[0U])[!ENDIF!],
            .numadc_inltrim = ((uint8)[!IF "(node:value(CddAdcHwInstance) = 'CDD_ADCA' or node:value(CddAdcHwInstance) = 'CDD_ADCB')"!]6U[!ELSE!]3U[!ENDIF!])
        }[!IF "not(node:islast())"!],[!CR!][!ELSE!][!ENDIF!]
        [!NOCODE!][!VAR "PpbCount" = "num:i($PpbCount + num:i(count(CddAdcPpbConfig/*)))"!]
        [!VAR "HwGroupCount" = "num:i($HwGroupCount + num:i(count(CddAdcGroup/*)))"!][!ENDNOCODE!][!ENDLOOP!]

    },
    .groupcfg  =
    {
        [!VAR "channelnum"="num:i(0)"!][!LOOP "CddAdcConfigSet/CddAdcHwUnit/*"!][!LOOP "CddAdcGroup/*"!]
        [[!"num:i($GroupCount)"!]] =
        {
            /* HwunitId: [!"node:value(../../CddAdcHwInstance)"!] */
            .hwunit_index = (uint8)([!"num:i(node:value(../../CddAdcHwUnitId))"!]U),
            .grp_int = (Cdd_Adc_IntNumType)[!"CddAdcInterruptSelect"!],
            .continuetoint = (boolean)([!"num:i(node:when((CddAdcContinueToInterruptMode = 'false'),0,1))"!]U),
            .intsocsel = (Cdd_Adc_IntSocTriggerType)[!"CddAdcInterruptSocSelect"!],
#if(STD_ON == CDD_ADC_GRP_NOTIF_CAPABILITY_API)
            .groupend_notification = (Cdd_Adc_GroupEndNotifyType)[!IF "not(node:empty(CddAdcGroupNotification))"!][!"CddAdcGroupNotification"!][!ELSE!]NULL_PTR[!ENDIF!],
#endif
            .stream_numsamples = (Cdd_Adc_StreamNumSampleType)([!"CddAdcGroupStreamingNumSamples"!]U),
            .trigger_src = (Cdd_Adc_TriggerType)([!"CddAdcGroupTrigSrc"!]),
            .conversion_mode = (Cdd_Adc_GroupConvModeType)[!IF "CddAdcGroupConversionMode = 'CDD_ADC_CONV_MODE_CONTINUOUS'"!]CDD_ADC_CONV_MODE_CONTINUOUS[!ELSE!]CDD_ADC_CONV_MODE_ONESHOT[!ENDIF!],
            .trigsrc_type = (Cdd_Adc_TriggerSrcType)[!IF "CddAdcGroupTrigSrcType = 'CDD_ADC_TRIGG_SRC_HW'"!]CDD_ADC_TRIGG_SRC_HW[!ELSE!]CDD_ADC_TRIGG_SRC_SW[!ENDIF!],
            .access_mode = (Cdd_Adc_GroupAccessModeType)[!IF "CddAdcGroupAccessMode = 'CDD_ADC_ACCESS_MODE_SINGLE'"!]CDD_ADC_ACCESS_MODE_SINGLE[!ELSE!]CDD_ADC_ACCESS_MODE_STREAMING[!ENDIF!],
            .streambuffermode = (Cdd_Adc_StreamBufferModeType)[!IF "CddAdcGroupStreamingBufferMode = 'CDD_ADC_STREAM_BUFFER_LINEAR'"!]CDD_ADC_STREAM_BUFFER_LINEAR[!ELSE!]CDD_ADC_STREAM_BUFFER_CIRCULAR[!ENDIF!],
            .startchannelnum = (uint8)([!"num:i($channelnum)"!]U),
            .channelcount = (uint8)([!"num:i(count(CddAdcChannel/*))"!]U),
            .soc_mask =  (uint32)([!"num:i(CddAdcGroupSocMask)"!]U),
            .lastsocnum = (uint8)([!"num:i(num:max(CddAdcChannel/*/CddAdcSocNumber))"!]U),
            .dma_mode = ((boolean)([!"num:i(node:when((CddAdcEnableDma = 'false'),0,1))"!]U))
        }[!VAR "channelnum"="$channelnum+num:i(count(CddAdcChannel/*))"!][!VAR "GroupCount" = "$GroupCount+1"!][!IF "$GroupCount < num:i(count(as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcHwUnit/*/CddAdcGroup/*))"!],[!CR!][!ELSE!][!ENDIF!]
        [!ENDLOOP!][!ENDLOOP!]

    },
[!IF "(CddAdcGeneral/CddAdcEnableGlobalSoftwareTrigger = 'true')"!]
    .glbtrigcfg =
    {
        [!LOOP "CddAdcConfigSet/CddAdcGlobalSwTrigger/*"!]
        [!NOCODE!]
            [!VAR "AdcMask" = "num:i(0)"!]
            [!VAR "GlbSwTriggerGroupMask" = "num:i(0)"!]
            [!VAR "Num" = "num:i(0)"!]
            [!VAR "HwIndex" = "num:i(0)"!]
            [!VAR "GlbTrigSocMask" = "num:i(0)"!]
            [!VAR "GlbTrigHwSocMask0" = "num:i(0)"!]
            [!VAR "GlbTrigHw0" = "num:i(0)"!]
            [!VAR "GlbTrigHwSocMask1" = "num:i(0)"!]
            [!VAR "GlbTrigHw1" = "num:i(0)"!]
            [!VAR "GlbTrigHwSocMask2" = "num:i(0)"!]
            [!VAR "GlbTrigHw2" = "num:i(0)"!]
            [!VAR "GlbTrigHwSocMask3" = "num:i(0)"!]
            [!VAR "GlbTrigHw3" = "num:i(0)"!]
            [!VAR "GlbTrigHwSocMask4" = "num:i(0)"!]
            [!VAR "GlbTrigHw4" = "num:i(0)"!]
        [!ENDNOCODE!]
        [[!"@index"!]] =
        {
            [!NOCODE!]
                [!LOOP "CddAdcHwGroup/*"!]
                    [!VAR "Num"!][!CALL "GetAdcNum", "HwUnit" = "CddAdcHwUnit"!][!ENDVAR!]
                    [!VAR "AdcMask" = "bit:or(num:i(bit:bitset(0,$Num)),$AdcMask)"!]
                    [!VAR "HwIndex" = "node:value(concat(node:path(node:ref(CddAdcHwGroupRef)),'/../../CddAdcHwUnitId'))"!]
                    [!VAR "GlbTrigSocMask" = "num:i(bit:or(node:value(CddAdcSocMask),$GlbTrigSocMask))"!]
                    [!VAR "HwGroupCountNum" ="num:i(0)"!]
                    [!IF "$HwIndex = 0"!]
                        [!VAR "GlbTrigHw0" = "num:i($GlbTrigHw0+1)"!]
                        [!VAR "GlbTrigHwSocMask0" = "num:i(bit:or($GlbTrigHwSocMask0,node:value(CddAdcSocMask)))"!]
                        [!VAR "HwGroupCountNum" ="num:i($HwGroup0Cnt)"!]
                    [!ELSEIF "$HwIndex = 1"!]
                        [!VAR "GlbTrigHw1" = "num:i($GlbTrigHw1+1)"!]
                        [!VAR "GlbTrigHwSocMask1" = "num:i(bit:or($GlbTrigHwSocMask1,node:value(CddAdcSocMask)))"!]
                        [!VAR "HwGroupCountNum" ="num:i($HwGroup1Cnt)"!]
                    [!ELSEIF "$HwIndex = 2"!]
                        [!VAR "GlbTrigHw2" = "num:i($GlbTrigHw2+1)"!]
                        [!VAR "GlbTrigHwSocMask2" = "num:i(bit:or($GlbTrigHwSocMask2,node:value(CddAdcSocMask)))"!]
                        [!VAR "HwGroupCountNum" ="num:i($HwGroup2Cnt)"!]
                    [!ELSEIF "$HwIndex = 3"!]
                        [!VAR "GlbTrigHw3" = "num:i($GlbTrigHw3+1)"!]
                        [!VAR "GlbTrigHwSocMask3" = "num:i(bit:or($GlbTrigHwSocMask3,node:value(CddAdcSocMask)))"!]
                        [!VAR "HwGroupCountNum" ="num:i($HwGroup3Cnt)"!]
                    [!ELSEIF "$HwIndex = 4"!]
                        [!VAR "GlbTrigHw4" = "num:i($GlbTrigHw4+1)"!]
                        [!VAR "GlbTrigHwSocMask4" = "num:i(bit:or($GlbTrigHwSocMask4,node:value(CddAdcSocMask)))"!]
                        [!VAR "HwGroupCountNum" ="num:i($HwGroup4Cnt)"!]
                    [!ENDIF!]
                    [!VAR "GlbSwTriggerGroupMask" = "bit:or(bit:bitset(0,($HwGroupCountNum+node:pos(node:path(node:ref(CddAdcHwGroupRef))))),$GlbSwTriggerGroupMask)"!]
                [!ENDLOOP!]
                        [!IF "($GlbTrigHw0 != 0) and ($GlbTrigHwSocMask0 != $GlbTrigSocMask)"!]
                            [!ERROR "SocMask should match for all the hardware units combining all the configured groups of a hardware unit"!]
                        [!ELSEIF "($GlbTrigHw1 != 0) and ($GlbTrigHwSocMask1 != $GlbTrigSocMask)"!]
                            [!ERROR "SocMask should match for all the hardware units combining all the configured groups of a hardware unit"!]
                        [!ELSEIF "($GlbTrigHw2 != 0) and ($GlbTrigHwSocMask2 != $GlbTrigSocMask)"!]
                            [!ERROR "SocMask should match for all the hardware units combining all the configured groups of a hardware unit"!]
                        [!ELSEIF "($GlbTrigHw3 != 0) and ($GlbTrigHwSocMask3 != $GlbTrigSocMask)"!]
                            [!ERROR "SocMask should match for all the hardware units combining all the configured groups of a hardware unit"!]
                        [!ELSEIF "($GlbTrigHw4 != 0) and ($GlbTrigHwSocMask4 != $GlbTrigSocMask)"!]
                            [!ERROR "SocMask should match for all the hardware units combining all the configured groups of a hardware unit"!]
                        [!ENDIF!]
            [!ENDNOCODE!]
            .hwunit_mask = (uint8)([!"num:i($AdcMask)"!]U),
            .soc_mask = (uint32)([!"num:i($GlbTrigSocMask)"!]U),
            .group_mask = (uint32)([!"num:i($GlbSwTriggerGroupMask)"!]U)
        }[!IF "not(node:islast())"!],[!CR!][!ELSE!][!ENDIF!][!ENDLOOP!]

    },
    [!LOOP "/AUTOSAR/TOP-LEVEL-PACKAGES/ResourceAllocator/ELEMENTS/ResourceAllocator/ResourceAllocatorGeneral/Context/*/.//*[@name='GlbSwFrcBaseAddr']"!]
    .glbsw_baseaddr = ((uint32)[!"node:value(.)"!]),[!BREAK!]
    [!ENDLOOP!]
[!ENDIF!]

[!IF "(CddAdcGeneral/CddAdcPpbEnable = 'true')"!]
    .ppbcfg =
    {
        [!NOCODE!]
        [!VAR "PpbEvtNotification"="num:i(0)"!]
        [!LOOP "CddAdcConfigSet/CddAdcHwUnit/*/CddAdcPpbConfig/*"!]
            [!IF "node:exists(.)"!]
                [!VAR "PpbEvtNotification"="num:i($PpbEvtNotification+1)"!]
            [!ENDIF!]
        [!ENDLOOP!]
        [!VAR "PpbCount" = "0"!][!ENDNOCODE!]
        [!LOOP "CddAdcConfigSet/CddAdcHwUnit/*"!][!LOOP "CddAdcPpbConfig/*"!]
        [[!"num:i($PpbCount)"!]] =  
        {
            /* HwunitId: [!"node:value(../../CddAdcHwInstance)"!] */
            .ppb_id = (Cdd_Adc_PpbIdType)([!"CddAdcPpbInstance"!]U),
            .soc_num = (uint8)([!"num:i(node:value(concat(node:path(node:ref(CddAdcPpbChannel)),'/CddAdcSocNumber')))"!]U),
            .hwunitindex = (uint8)([!"num:i(node:pos(../../.))"!]U),
            .ppb_caloffset = (uint16)([!"CddAdcPpbCalibrationOffset"!]U),
            .ppb_refoffset = (uint16)([!"CddAdcPpbReferenceOffset"!]U),
            .ppbresconfig = (uint16)((0x0000U) | (((uint16)[!"num:i(node:when((CddAdcPpbDeltaEnable = 'false'),0,1))"!]U)<<8U) | (((uint16)[!"num:i(node:when((CddAdcPpbEnableTwosComplement = 'false'),0,1))"!]U)<<7U) | (((uint16)[!"num:i(node:when((CddAdcPpbAbsoluteEnable = 'false'),0,1))"!]U)<<6U) | (((uint16)[!"num:i(node:when((CddAdcPpbCyclebyCycleEnable = 'false'),0,1))"!]U)<<5U)),
            .triplimithi = (sint32)[!"CddAdcPpbTripHighLimit"!],
            .triplimitlow = (sint32)[!"CddAdcPpbTripLowLimit"!],
            .tripevtsel = (uint8)((0x00U) | ([!"num:i(node:when((CddAdcPpbTripHighEventEnable='false'),0,1))"!]U) | ([!"num:i(node:when((CddAdcPpbTripLowEventEnable='false'),0,1))"!]U<<1U) | ([!"num:i(node:when((CddAdcPpbZeroCrossingEventEnable='false'),0,1))"!]U<<2U)),
            .tripevtintsel = (uint8)((0x00U) | ([!"num:i(node:when((CddAdcPpbTripHighInterruptEnable = 'false'),0,1))"!]U) | (([!"num:i(node:when((CddAdcPpbTripLowInterruptEnable = 'false'),0,1))"!]U)<<1U) | (([!"num:i(node:when((CddAdcPpbZeroCrossingInterruptEnable = 'false'),0,1))"!]U)<<2U)),
        #if(STD_ON == CDD_ADC_PPB_NOTIF_CAPABILITY_API)
            .ppbevtint_notification = (Cdd_Adc_PpbNotifyType)[!IF "not(node:empty(CddAdcPpbEventInterruptNotification))"!][!"CddAdcPpbEventInterruptNotification"!][!ELSE!]NULL_PTR[!ENDIF!],
        #endif
            .ppbcountlimit = (uint16)([!"CddAdcPpbAccumulationCountLimit"!]U),
            .ppbcfg2 = (uint16)((0x0000U) | (((uint8)[!"CddAdcPpbCompareSource"!])<<14U) | ([!"CddAdcPpbRightShift"!]U)),
            .tripfilterenable = (boolean)[!"num:i(node:when((CddAdcPpbTripFilterEnable = 'true'),1,0))"!]U,
            .tripfilctl = (uint16)[!IF "CddAdcPpbTripFilterEnable = 'true'"!]((0x0000U) | (([!"num:i(CddAdcTripFilterConfig/CddAdcTripFilterTreshold)"!]U)<<9U) | (([!"num:i(CddAdcTripFilterConfig/CddAdcTripFilterSampleWindow)"!]U)<<3U) | (([!"num:i(node:when((CddAdcTripFilterConfig/CddAdcTripFilterLowEnable = 'false'),0,1))"!]U)<<1U) | ([!"num:i(node:when((CddAdcTripFilterConfig/CddAdcTripFilterHighEnable = 'false'),0,1))"!]U))[!ELSE!](0x0000U)[!ENDIF!],     
            .tripfilclk = (uint16)[!IF "CddAdcPpbTripFilterEnable = 'true'"!]((0x0000U) | ([!"num:i(CddAdcTripFilterConfig/CddAdcTripFilterClk)"!]U))[!ELSE!](0x0000U)[!ENDIF!]

