TexasInstruments/f29h85x-mcal/plugins/Adc_TI_F29H85x/generate/src/Cdd_Adc_Cfg.c
        }[!VAR "PpbCount" = "$PpbCount+1"!][!IF "$PpbCount < num:i(count(as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcHwUnit/*/CddAdcPpbConfig/*))"!],[!CR!][!ELSE!][!ENDIF!][!ENDLOOP!][!ENDLOOP!]

    },
[!ENDIF!]
    .channelcfg =
    {
        [!VAR "channelnum"="num:i(0)"!][!LOOP "CddAdcConfigSet/CddAdcHwUnit/*/CddAdcGroup/*/CddAdcChannel/*"!]
        [[!"num:i($channelnum)"!]] =
        {
            /* HwunitId:[!"node:value(../../../../CddAdcHwInstance)"!] Group:[!"num:i(node:pos(../../.))"!] */
            .channel_id = (uint8)([!"node:value(CddAdcChannelId)"!]U),
            .sample_window = (uint16)([!"CddAdcChannelSampleWindow"!]U),
#if (CDD_ADC_EXTCHSEL_CAPABILITY == STD_ON)
            .extchannelnum = (uint8)([!"CddAdcSocExternalChannelSelect"!]U),
#endif   
            .soc_num =  (uint8)([!"CddAdcSocNumber"!]U)
        }[!VAR "channelnum"="num:i($channelnum+1)"!][!IF "$channelnum < num:i(count(as:modconf('Cdd_Adc/Cdd')[as:path(node:dtos(.))='/TI_F29H85x/Cdd_Adc/Cdd']/CddAdcConfigSet/CddAdcHwUnit/*/CddAdcGroup/*/CddAdcChannel/*))"!],[!CR!][!ELSE!][!ENDIF!]
        [!ENDLOOP!]

    },
[!IF "(CddAdcGeneral/CddAdcSafetyCheckerEnable = 'true')"!]      
    .checkercfg =
    {
        .checkerunitcfg = 
        {
            [!LOOP "CddAdcConfigSet/CddAdcResultCheckerUnit/*"!]
            [[!"@index"!]] =
            {
                .checker_id = (Cdd_Adc_CheckerType)([!"num:i(num:i(substring-after(node:value(node:ref(CddAdcCheckerInstanceRef)/SafetyCheckerInstance),'ADCSAFETYCHECK')) - num:i(1))"!]U),
                .tolerance = (uint32)([!"node:value(CddAdcCheckerTolerance)"!]U),
                .base_addr = (uint32)([!"node:value(node:ref(CddAdcCheckerInstanceRef)/BaseAddr)"!]),
                .selresult = 
                {
                    [0] =
                    {
                        .hwunit_index =  (uint8)([!IF "(node:value(CddAdcSelResConfig1/CddAdcCheckerResultType) = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB') or (node:value(CddAdcSelResConfig1/CddAdcCheckerResultType) = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcPpbReference)),'/../../CddAdcHwUnitId')))"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcChannelReference)),'/../../../../CddAdcHwUnitId')))"!][!ENDIF!]U),
                        .res_num = (uint8)([!IF "(CddAdcSelResConfig1/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcPpbReference)),'/CddAdcPpbInstance'))+32)"!][!ELSEIF "(CddAdcSelResConfig1/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcPpbReference)),'/CddAdcPpbInstance'))+36)"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcChannelReference)),'/CddAdcSocNumber')))"!][!ENDIF!]U),
                        .soc_num = (uint8)([!IF "(CddAdcSelResConfig1/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB') or (CddAdcSelResConfig1/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcPpbReference)),'/CddAdcPpbSocNumber')))"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig1/CddAdcChannelReference)),'/CddAdcSocNumber')))"!][!ENDIF!]U),
                        .res_type = (Cdd_Adc_CheckerInputType)[!"CddAdcSelResConfig1/CddAdcCheckerResultType"!]
                    },
                    [1] = 
                    {
                        .hwunit_index =  (uint8)([!IF "(node:value(CddAdcSelResConfig2/CddAdcCheckerResultType) = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB') or (node:value(CddAdcSelResConfig2/CddAdcCheckerResultType) = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcPpbReference)),'/../../CddAdcHwUnitId')))"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcChannelReference)),'/../../../../CddAdcHwUnitId')))"!][!ENDIF!]U),
                        .res_num = (uint8)([!IF "(CddAdcSelResConfig2/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcPpbReference)),'/CddAdcPpbInstance'))+32)"!][!ELSEIF "(CddAdcSelResConfig2/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcPpbReference)),'/CddAdcPpbInstance'))+36)"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcChannelReference)),'/CddAdcSocNumber')))"!][!ENDIF!]U),
                        .soc_num = (uint8)([!IF "(CddAdcSelResConfig2/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPB') or (CddAdcSelResConfig2/CddAdcCheckerResultType = 'CDD_ADC_SAFETY_CHECKER_INPUT_PPBSUM')"!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcPpbReference)),'/CddAdcPpbSocNumber')))"!][!ELSE!][!"num:i(node:value(concat(node:path(node:ref(CddAdcSelResConfig2/CddAdcChannelReference)),'/CddAdcSocNumber')))"!][!ENDIF!]U),
                        .res_type = (Cdd_Adc_CheckerInputType)[!"CddAdcSelResConfig2/CddAdcCheckerResultType"!]
                    }
                }
            }[!IF "not(node:islast())"!],[!CR!][!ELSE!][!ENDIF!][!ENDLOOP!]

        },
    [!IF "num:i(count(CddAdcConfigSet/CddAdcCheckerIntEvtConfig/*)) > 0"!]
        .checkerintevtcfg = 
        {
            [!LOOP "CddAdcConfigSet/CddAdcCheckerIntEvtConfig/*"!]
            [[!"@index"!]] =
            {                
                [!NOCODE!]
                [!VAR "Evt1Res1OvfMask" = "num:i(0)"!][!VAR "Evt1Res2OvfMask" = "num:i(0)"!][!VAR "Evt1OotMask" = "num:i(0)"!]
                [!VAR "Evt2Res1OvfMask" = "0"!][!VAR "Evt2Res2OvfMask" = "0"!][!VAR "Evt2OotMask" = "0"!]
                [!VAR "Evt3Res1OvfMask" = "0"!][!VAR "Evt3Res2OvfMask" = "0"!][!VAR "Evt3OotMask" = "0"!]
                [!VAR "Evt4Res1OvfMask" = "0"!][!VAR "Evt4Res2OvfMask" = "0"!][!VAR "Evt4OotMask" = "0"!]
                [!VAR "EvtIntRes1OvfMask" = "0"!][!VAR "EvtIntRes2OvfMask" = "0"!][!VAR "EvtIntOotMask" = "0"!]
                [!LOOP "CddAdcCheckerIntEvtConfiguration/*"!]
                    [!VAR "CheckerId" = "num:i(num:i(substring-after(node:value(node:ref(node:ref(CddAdcSafetyCheckerInstance)/CddAdcCheckerInstanceRef)/SafetyCheckerInstance),'ADCSAFETYCHECK')) - num:i(1))"!]
                    [!VAR "Evt1Res1OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt1Source/CddAdcCheckerRes1Ovf) = 'true',1,0)),$CheckerId),$Evt1Res1OvfMask)"!]
                    [!VAR "Evt1Res2OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt1Source/CddAdcCheckerRes2Ovf) = 'true',1,0)),$CheckerId),$Evt1Res2OvfMask)"!]
                    [!VAR "Evt1OotMask"     = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt1Source/CddAdcCheckerOot) = 'true',1,0)),$CheckerId),$Evt1OotMask)"!]
                    
                    [!VAR "Evt2Res1OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt2Source/CddAdcCheckerRes1Ovf) = 'true',1,0)),$CheckerId),$Evt2Res1OvfMask)"!]
                    [!VAR "Evt2Res2OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt2Source/CddAdcCheckerRes2Ovf) = 'true',1,0)),$CheckerId),$Evt2Res2OvfMask)"!]
                    [!VAR "Evt2OotMask"     = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt2Source/CddAdcCheckerOot) = 'true',1,0)),$CheckerId),$Evt2OotMask)"!]
                    
                    [!VAR "Evt3Res1OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt3Source/CddAdcCheckerRes1Ovf) = 'true',1,0)),$CheckerId),$Evt3Res1OvfMask)"!]
                    [!VAR "Evt3Res2OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt3Source/CddAdcCheckerRes2Ovf) = 'true',1,0)),$CheckerId),$Evt3Res2OvfMask)"!]
                    [!VAR "Evt3OotMask"     = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt3Source/CddAdcCheckerOot) = 'true',1,0)),$CheckerId),$Evt3OotMask)"!]
                    
