TexasInstruments/f29h85x-mcal/plugins/Adc_TI_F29H85x/generate/src/Cdd_Adc_Cfg.c
                    [!VAR "Evt4Res1OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt4Source/CddAdcCheckerRes1Ovf) = 'true',1,0)),$CheckerId),$Evt4Res1OvfMask)"!]
                    [!VAR "Evt4Res2OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt4Source/CddAdcCheckerRes2Ovf) = 'true',1,0)),$CheckerId),$Evt4Res2OvfMask)"!]
                    [!VAR "Evt4OotMask"     = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerEvt4Source/CddAdcCheckerOot) = 'true',1,0)),$CheckerId),$Evt4OotMask)"!]
                    
                    [!VAR "EvtIntRes1OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerIntSource/CddAdcCheckerRes1Ovf) = 'true',1,0)),$CheckerId),$EvtIntRes1OvfMask)"!]
                    [!VAR "EvtIntRes2OvfMask" = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerIntSource/CddAdcCheckerRes2Ovf) = 'true',1,0)),$CheckerId),$EvtIntRes2OvfMask)"!]
                    [!VAR "EvtIntOotMask"     = "bit:or(bit:shl(num:i(node:when(node:value(CddAdcCheckerIntSource/CddAdcCheckerOot) = 'true',1,0)),$CheckerId),$EvtIntOotMask)"!]
                [!ENDLOOP!]
                [!ENDNOCODE!]
                .base_addr = (uint32)([!"node:value(node:ref(CddAdcCheckerIntEvtInstanceRef)/BaseAddr)"!]),
                .intevt_id = (uint8)([!"num:i(num:i(substring-after(node:value(node:ref(CddAdcCheckerIntEvtInstanceRef)/SafetyCheckerIntEvtInstance),'ADCSAFETYCHECKINTEVT')) - num:i(1))"!]U),
                .checkevtint =
                {
                    .res1ovf = (uint16)([!"num:i($EvtIntRes1OvfMask)"!]U),
                    .res2ovf = (uint16)([!"num:i($EvtIntRes2OvfMask)"!]U),
                    .ootflg  = (uint16)([!"num:i($EvtIntOotMask)"!]U)  
                },
                .checkevt =
                {
                    [!FOR "x" = "0" TO "3"!]
                    [[!"$x"!]] =
                    {
                        .res1ovf = (uint16)([!IF "num:i($x) = '0'"!][!"num:i($Evt1Res1OvfMask)"!][!ELSEIF "num:i($x) = '1'"!][!"num:i($Evt2Res1OvfMask)"!][!ELSEIF "num:i($x) = '2'"!][!"num:i($Evt3Res1OvfMask)"!][!ELSEIF "num:i($x) = '3'"!][!"num:i($Evt4Res1OvfMask)"!][!ENDIF!]U),
                        .res2ovf = (uint16)([!IF "num:i($x) = '0'"!][!"num:i($Evt1Res2OvfMask)"!][!ELSEIF "num:i($x) = '1'"!][!"num:i($Evt2Res2OvfMask)"!][!ELSEIF "num:i($x) = '2'"!][!"num:i($Evt3Res2OvfMask)"!][!ELSEIF "num:i($x) = '3'"!][!"num:i($Evt4Res2OvfMask)"!][!ENDIF!]U),
                        .ootflg  = (uint16)([!IF "num:i($x) = '0'"!][!"num:i($Evt1OotMask)"!][!ELSEIF "num:i($x) = '1'"!][!"num:i($Evt2OotMask)"!][!ELSEIF "num:i($x) = '2'"!][!"num:i($Evt3OotMask)"!][!ELSEIF "num:i($x) = '3'"!][!"num:i($Evt4OotMask)"!][!ENDIF!]U)
                    }[!IF "$x < '3'"!],[!CR!][!ELSE!][!ENDIF!][!ENDFOR!]

                }
            }[!IF "not(node:islast())"!],[!CR!][!ELSE!][!ENDIF!][!ENDLOOP!] 

        }
    [!ENDIF!]
    },
[!ENDIF!]
[!IF "($TrigRepEnable > 0)"!]
    .repunitcfg =
    {
        [!LOOP "CddAdcConfigSet/CddAdcHwUnit/*/CddAdcTriggerRepeater/*"!]
        [[!"num:i($RepCount)"!]] =
        {
            .hwunit_index = (uint8)([!"num:i(node:value(../../CddAdcHwUnitId))"!]U),
            .repeater_instance = (Cdd_Adc_RepeaterType)[!IF "CddAdcRepeaterInstance ='0'"!]CDD_ADC_REPINST1[!ELSE!]CDD_ADC_REPINST2[!ENDIF!],
            .repeater_mode = (Cdd_Adc_RepeaterModeType)[!IF "CddAdcRepeaterMode='OVERSAMPLING_MODE'"!]CDD_ADC_REPMODE_OVERSAMPLING[!ELSE!]CDD_ADC_REPMODE_UNDERSAMPLING[!ENDIF!],
            .trigger_source = (Cdd_Adc_TriggerType)[!"CddAdcRepeaterTriggerSrc"!],
            .repeater_count =  (uint8)([!"CddAdcTriggerCount"!]U),
            .repeater_phase =  (uint16)([!"CddAdcTriggerPhaseDelay"!]U),
            .repeater_spread =  (uint16)([!IF "node:exists(CddAdcTriggerSpreadDelay)"!][!"CddAdcTriggerSpreadDelay"!][!ELSE!]0[!ENDIF!]U)
        }[!VAR "RepCount" = "num:i($RepCount+1)"!][!IF "($RepCount != $TrigRepEnable)"!],[!CR!][!ELSE!][!ENDIF!][!ENDLOOP!]

    },
[!ENDIF!]
    .test_input = (Cdd_Adc_InternalTestNodeType)[!"node:value(CddAdcConfigSet/CddAdcInternalTestInput)"!]
};
[!ENDSELECT!]


#define CDD_ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
#include "Cdd_Adc_MemMap.h"

/*********************************************************************************************************************
 * Local Object Definitions
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Local Function Prototypes
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Local Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  External Functions Definition
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Local Functions Definition
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  End of File: Cdd_Adc_Cfg.c
 *********************************************************************************************************************/
